tutorials/rhoCentralFoam/obliqueShock/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho  diagonal {};
    rhoU diagonal {};
    rhoE diagonal {};

    U smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-09;
        relTol           0.01;
    };

    h smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-10
        relTol           0;
    };
}

// ************************************************************************* //
